// Функція getLength(array) очікує один параметр array - масив довільних значень.
// Доповни код функції так, щоб вона перетворювала масив у рядок, без роздільників,
//     і повертала кількість символів в отриманому рядку.

// Оголошена функція getLength(array)
// Виклик getLength(["Mango", "hurries", "to", "the", "train"]) повертає 22
// Виклик getLength(["M", "a", "n", "g", "o"]) повертає 5
// Виклик getLength(["top", "picks", "for", "you"]) повертає 14
//======================================================================================================
// Для того, щоб перетворити масив у рядок без роздільників, можна скористатися методом`join()`.
// Для отримання кількості символів у рядку можна використати властивість`length`.
//   Отже, код функції `getLength` буде наступним:

function getLength(array) {
  return array.join("").length;
}

// Тепер, при виклику функції`getLength(["Mango", "hurries", "to", "the", "train"])`, отримаємо 22,
//   при виклику`getLength(["M", "a", "n", "g", "o"])` - 5,
//     а при виклику`getLength(["top", "picks", "for", "you"])` - 14.
