// Оголоси змінну message.Використовуючи конкатенацію рядків, задай їй наступне значення — рядок привітання користувача зі зверненням по імені.
//     Ім'я зберігається в змінній username.

// Повідомлення привітання має виглядати так: "Welcome Poly!", де Poly — це значення змінної username.
// Зверни увагу, що пробіл має відноситися до рядка "Welcome "

// Оголошена змінна username
// Значення змінної username - це рядок "Poly"
// Оголошена змінна message
// Значення змінної message - це рядок "Welcome Poly!"
// Використаний оператор +

const username = "Poly";
const message = "Welcome " + username + "!";
